MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX174F256B.atdf
         <register caption="ADC Control Register 2" name="AD1CON2" offset="0x10" rw="RW" size="4" initval="0x0">
            <bitfield caption="Alternate Input Sample Mode Select bit" mask="0x00000001" name="ALTS" values="AD1CON2__ALTS" />
            <bitfield caption="ADC Result Buffer Mode Select bit" mask="0x00000002" name="BUFM" values="AD1CON2__BUFM" />
            <bitfield caption="Sample/Convert Sequences Per Interrupt Selection bits" mask="0x0000003C" name="SMPI" values="AD1CON2__SMPI" />
            <bitfield caption="Buffer Fill Status bit" mask="0x00000080" name="BUFS" values="AD1CON2__BUFS" />
            <bitfield caption="Input Scan Select bit" mask="0x00000400" name="CSCNA" values="AD1CON2__CSCNA" />
            <bitfield caption="Input Offset Calibration Mode Select bit" mask="0x00001000" name="OFFCAL" values="AD1CON2__OFFCAL" />
            <bitfield caption="Voltage Reference Configuration bits" mask="0x0000E000" name="VCFG" values="AD1CON2__VCFG" />
         </register>
         <register caption="ADC Control Register 3" name="AD1CON3" offset="0x20" rw="RW" size="4" initval="0x0">
            <bitfield caption="ADC Conversion Clock Select bits" mask="0x000000FF" name="ADCS" values="AD1CON3__ADCS" />
            <bitfield caption="Auto-Sample Time bits" mask="0x00001F00" name="SAMC" values="AD1CON3__SAMC" />
            <bitfield caption="ADC Conversion Clock Source bit" mask="0x00008000" name="ADRC" values="AD1CON3__ADRC" />
         </register>

         <register caption="ADC Input Select Register" name="AD1CHS" offset="0x40" rw="RW" size="4" initval="0x0">
            <bitfield caption="Positive Input Select bits for Sample A Multiplexer Setting" mask="0x003F0000" name="CH0SA" values="AD1CHS__CH0SA" />
            <bitfield caption="Negative Input Select bit for Sample A Multiplexer Setting" mask="0x00800000" name="CH0NA" values="AD1CHS__CH0NA" />
            <bitfield caption="Positive Input Select bits for Sample B" mask="0x3F000000" name="CH0SB" values="AD1CHS__CH0SB" />
            <bitfield caption="Negative Input Select bit for Sample B" mask="0x80000000" name="CH0NB" values="AD1CHS__CH0NB" />
         </register>
         <register caption="ADC Input Scan Select Register" name="AD1CSSL" offset="0x50" rw="RW" size="4" initval="0x0">
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000001" name="CSSL0" values="AD1CSSL__CSSL0" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000002" name="CSSL1" values="AD1CSSL__CSSL1" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000004" name="CSSL2" values="AD1CSSL__CSSL2" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000008" name="CSSL3" values="AD1CSSL__CSSL3" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000010" name="CSSL4" values="AD1CSSL__CSSL4" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000020" name="CSSL5" values="AD1CSSL__CSSL5" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000200" name="CSSL9" values="AD1CSSL__CSSL9" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000400" name="CSSL10" values="AD1CSSL__CSSL10" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00000800" name="CSSL11" values="AD1CSSL__CSSL11" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00001000" name="CSSL12" values="AD1CSSL__CSSL12" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00002000" name="CSSL13" values="AD1CSSL__CSSL13" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00004000" name="CSSL14" values="AD1CSSL__CSSL14" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00008000" name="CSSL15" values="AD1CSSL__CSSL15" />
            <bitfield caption="ADC Input Pin Scan Selection bits" mask="0x00020000" name="CSSL17" values="AD1CSSL__CSSL17" />
         </register>
         <register caption="" name="ADC1BUF0" offset="0x70" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF0" />
         </register>
         <register caption="" name="ADC1BUF1" offset="0x80" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF1" />
         </register>
         <register caption="" name="ADC1BUF2" offset="0x90" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF2" />
         </register>
         <register caption="" name="ADC1BUF3" offset="0xa0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF3" />
         </register>
         <register caption="" name="ADC1BUF4" offset="0xb0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF4" />
         </register>
         <register caption="" name="ADC1BUF5" offset="0xc0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF5" />
         </register>
         <register caption="" name="ADC1BUF6" offset="0xd0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF6" />
         </register>
         <register caption="" name="ADC1BUF7" offset="0xe0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF7" />
         </register>
         <register caption="" name="ADC1BUF8" offset="0xf0" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF8" />
         </register>
         <register caption="" name="ADC1BUF9" offset="0x100" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUF9" />
         </register>
         <register caption="" name="ADC1BUFA" offset="0x110" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFA" />
         </register>
         <register caption="" name="ADC1BUFB" offset="0x120" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFB" />
         </register>
         <register caption="" name="ADC1BUFC" offset="0x130" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFC" />
         </register>
         <register caption="" name="ADC1BUFD" offset="0x140" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFD" />
         </register>
         <register caption="" name="ADC1BUFE" offset="0x150" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFE" />
         </register>
         <register caption="" name="ADC1BUFF" offset="0x160" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADC1BUFF" />
         </register>
      </register-group>
      <value-group caption="Analog-to-Digital Conversion Status bit" name="AD1CON1__DONE">
         <value caption="Analog-to-digital conversion is done" name="" value="0x1" />
         <value caption="Analog-to-digital conversion is not done or has not started" name="" value="0x0" />
      </value-group>
