MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX174F256B.atdf
         <register caption="" name="ODCB" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ODCB" />
            <bitfield mask="0x00000002" name="ODCB" />
            <bitfield mask="0x00000004" name="ODCB" />
            <bitfield mask="0x00000008" name="ODCB" />
            <bitfield mask="0x00000010" name="ODCB" />
            <bitfield mask="0x00000020" name="ODCB" />
            <bitfield mask="0x00000040" name="ODCB" />
            <bitfield mask="0x00000080" name="ODCB" />
            <bitfield mask="0x00000100" name="ODCB" />
            <bitfield mask="0x00000200" name="ODCB" />
            <bitfield mask="0x00000400" name="ODCB" />
            <bitfield mask="0x00000800" name="ODCB" />
            <bitfield mask="0x00001000" name="ODCB" />
            <bitfield mask="0x00002000" name="ODCB" />
            <bitfield mask="0x00004000" name="ODCB" />
            <bitfield mask="0x00008000" name="ODCB" />
         </register>
         <register caption="" name="CNPUA" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUA" />
            <bitfield mask="0x00000002" name="CNPUA" />
            <bitfield mask="0x00000004" name="CNPUA" />
            <bitfield mask="0x00000008" name="CNPUA" />
            <bitfield mask="0x00000010" name="CNPUA" />
            <bitfield mask="0x00000020" name="CNPUA" />
            <bitfield mask="0x00000040" name="CNPUA" />
            <bitfield mask="0x00000080" name="CNPUA" />
            <bitfield mask="0x00000100" name="CNPUA" />
            <bitfield mask="0x00000200" name="CNPUA" />
            <bitfield mask="0x00000400" name="CNPUA" />
            <bitfield mask="0x00000800" name="CNPUA" />
            <bitfield mask="0x00001000" name="CNPUA" />
            <bitfield mask="0x00002000" name="CNPUA" />
            <bitfield mask="0x00004000" name="CNPUA" />
            <bitfield mask="0x00008000" name="CNPUA" />
         </register>
         <register caption="" name="CNPUB" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPUB" />
            <bitfield mask="0x00000002" name="CNPUB" />
            <bitfield mask="0x00000004" name="CNPUB" />
            <bitfield mask="0x00000008" name="CNPUB" />
            <bitfield mask="0x00000010" name="CNPUB" />
            <bitfield mask="0x00000020" name="CNPUB" />
            <bitfield mask="0x00000040" name="CNPUB" />
            <bitfield mask="0x00000080" name="CNPUB" />
            <bitfield mask="0x00000100" name="CNPUB" />
            <bitfield mask="0x00000200" name="CNPUB" />
            <bitfield mask="0x00000400" name="CNPUB" />
            <bitfield mask="0x00000800" name="CNPUB" />
            <bitfield mask="0x00001000" name="CNPUB" />
            <bitfield mask="0x00002000" name="CNPUB" />
            <bitfield mask="0x00004000" name="CNPUB" />
            <bitfield mask="0x00008000" name="CNPUB" />
         </register>
         <register caption="" name="CNPDA" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDA" />
            <bitfield mask="0x00000002" name="CNPDA" />
            <bitfield mask="0x00000004" name="CNPDA" />
            <bitfield mask="0x00000008" name="CNPDA" />
            <bitfield mask="0x00000010" name="CNPDA" />
            <bitfield mask="0x00000020" name="CNPDA" />
            <bitfield mask="0x00000040" name="CNPDA" />
            <bitfield mask="0x00000080" name="CNPDA" />
            <bitfield mask="0x00000100" name="CNPDA" />
            <bitfield mask="0x00000200" name="CNPDA" />
            <bitfield mask="0x00000400" name="CNPDA" />
            <bitfield mask="0x00000800" name="CNPDA" />
            <bitfield mask="0x00001000" name="CNPDA" />
            <bitfield mask="0x00002000" name="CNPDA" />
            <bitfield mask="0x00004000" name="CNPDA" />
            <bitfield mask="0x00008000" name="CNPDA" />
         </register>
         <register caption="" name="CNPDB" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNPDB" />
            <bitfield mask="0x00000002" name="CNPDB" />
            <bitfield mask="0x00000004" name="CNPDB" />
            <bitfield mask="0x00000008" name="CNPDB" />
            <bitfield mask="0x00000010" name="CNPDB" />
            <bitfield mask="0x00000020" name="CNPDB" />
            <bitfield mask="0x00000040" name="CNPDB" />
            <bitfield mask="0x00000080" name="CNPDB" />
            <bitfield mask="0x00000100" name="CNPDB" />
            <bitfield mask="0x00000200" name="CNPDB" />
            <bitfield mask="0x00000400" name="CNPDB" />
            <bitfield mask="0x00000800" name="CNPDB" />
            <bitfield mask="0x00001000" name="CNPDB" />
            <bitfield mask="0x00002000" name="CNPDB" />
            <bitfield mask="0x00004000" name="CNPDB" />
            <bitfield mask="0x00008000" name="CNPDB" />
         </register>
         <register caption="" name="CNCONA" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNCONB" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNENA" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENA" />
            <bitfield mask="0x00000002" name="CNENA" />
            <bitfield mask="0x00000004" name="CNENA" />
            <bitfield mask="0x00000008" name="CNENA" />
            <bitfield mask="0x00000010" name="CNENA" />
            <bitfield mask="0x00000020" name="CNENA" />
            <bitfield mask="0x00000040" name="CNENA" />
            <bitfield mask="0x00000080" name="CNENA" />
            <bitfield mask="0x00000100" name="CNENA" />
            <bitfield mask="0x00000200" name="CNENA" />
            <bitfield mask="0x00000400" name="CNENA" />
            <bitfield mask="0x00000800" name="CNENA" />
            <bitfield mask="0x00001000" name="CNENA" />
            <bitfield mask="0x00002000" name="CNENA" />
            <bitfield mask="0x00004000" name="CNENA" />
            <bitfield mask="0x00008000" name="CNENA" />
         </register>
         <register caption="" name="CNENB" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNENB" />
            <bitfield mask="0x00000002" name="CNENB" />
            <bitfield mask="0x00000004" name="CNENB" />
            <bitfield mask="0x00000008" name="CNENB" />
            <bitfield mask="0x00000010" name="CNENB" />
            <bitfield mask="0x00000020" name="CNENB" />
            <bitfield mask="0x00000040" name="CNENB" />
            <bitfield mask="0x00000080" name="CNENB" />
            <bitfield mask="0x00000100" name="CNENB" />
            <bitfield mask="0x00000200" name="CNENB" />
            <bitfield mask="0x00000400" name="CNENB" />
            <bitfield mask="0x00000800" name="CNENB" />
            <bitfield mask="0x00001000" name="CNENB" />
            <bitfield mask="0x00002000" name="CNENB" />
            <bitfield mask="0x00004000" name="CNENB" />
            <bitfield mask="0x00008000" name="CNENB" />
         </register>
         <register caption="" name="CNSTATA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATA" />
            <bitfield mask="0x00000002" name="CNSTATA" />
            <bitfield mask="0x00000004" name="CNSTATA" />
            <bitfield mask="0x00000008" name="CNSTATA" />
            <bitfield mask="0x00000010" name="CNSTATA" />
            <bitfield mask="0x00000020" name="CNSTATA" />
            <bitfield mask="0x00000040" name="CNSTATA" />
            <bitfield mask="0x00000080" name="CNSTATA" />
            <bitfield mask="0x00000100" name="CNSTATA" />
            <bitfield mask="0x00000200" name="CNSTATA" />
            <bitfield mask="0x00000400" name="CNSTATA" />
            <bitfield mask="0x00000800" name="CNSTATA" />
            <bitfield mask="0x00001000" name="CNSTATA" />
            <bitfield mask="0x00002000" name="CNSTATA" />
            <bitfield mask="0x00004000" name="CNSTATA" />
            <bitfield mask="0x00008000" name="CNSTATA" />
         </register>
         <register caption="" name="CNSTATB" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB" />
            <bitfield mask="0x00000002" name="CNSTATB" />
            <bitfield mask="0x00000004" name="CNSTATB" />
            <bitfield mask="0x00000008" name="CNSTATB" />
            <bitfield mask="0x00000010" name="CNSTATB" />
            <bitfield mask="0x00000020" name="CNSTATB" />
            <bitfield mask="0x00000040" name="CNSTATB" />
            <bitfield mask="0x00000080" name="CNSTATB" />
            <bitfield mask="0x00000100" name="CNSTATB" />
            <bitfield mask="0x00000200" name="CNSTATB" />
            <bitfield mask="0x00000400" name="CNSTATB" />
            <bitfield mask="0x00000800" name="CNSTATB" />
            <bitfield mask="0x00001000" name="CNSTATB" />
            <bitfield mask="0x00002000" name="CNSTATB" />
            <bitfield mask="0x00004000" name="CNSTATB" />
            <bitfield mask="0x00008000" name="CNSTATB" />
         </register>
      </register-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
